package etc;

public class 배열기본 {

	public static void main(String[] args) {
		/*
		 * 배열에 필수로 기억할 것 3가지!
		 * -> 적어보기!
		 */
		
		// 기초문제
		
		// 1. 배열 생성 + 초기화
		// 크기가 10인 정수타입 배열
		
		// 크기가 5인 문자열타입 배열
		
		
		// 2-1. 문자열 타입 배열 값을 각각 넣기(a부터 e까지)
		
		
		// 2-2. 정수타입 배열 값을 한번에 넣기(1부터 10까지)
		
		
		// 3-1. 문자열 타입 배열 값을 각각 출력해보기
		
		
		// 3-2. 정수 타입 배열 값을 한번에 출력해보기
		
		
		
		/* ********************************************* */
		
		/*
		 * 아래 문제들을 풀 때의 조건: 
		 *  	1. 앞의 기본 문제처럼 과정을 먼저 주석으로 작성해볼 것 
		 *  	2. BufferedReader 사용
		 *  		[hint - br.readLine(), Integer.parseInt()]
		 */
		
		/*
		 *  약간 심화 문제1>
		 *  20 10 35 30 7 을 입력받아 배열에 넣고 '한줄로' 출력
		 *		결과: 20,10,35,30,7
		 */

		
		/*
		 * 약간 심화 문제2>
		 * 50 60 70 80 100 를 입력받아 배열에 넣고 
		 * 	1. 50과 80 더하기
		 *  2. 60과 70과 100 더하기
		 *  3. 전체 다 더하기
		 */
		
		
		/*
		 * 심화 문제 1>
		 * 100 99 98 97 96 95 94 93 91를 입력받아 배열에 넣고
		 * 	1. 모든 수에 1씩 더하기
		 * 	2. 각 수에 해당 인덱스 더하기
		 * 		ex) 100의 인덱스는 ?이므로 100+?
		 * 			93의 인덱스는 ?이므로 93+?
		 */
	}

}
